tutorials/pitzDaily/Allrun
#!/bin/bash

blockMesh
refineMesh -overwrite
pimpleFoam