tutorials/pitzDaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;//latestTime;

startTime       0;

stopAt          endTime;

endTime         50e-5;

deltaT          5e-5;

writeControl    timeStep;//adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           5;

functions
{

  exportH5
    {
      type     exportToHDF5;
      functionObjectLibs ( "libhdf5.so" "libexportToHDF5.so");
      outputControl outputTime;//timeStep;
      //      outputInterval 1;
      filename "results.h5foam";
      fields (p U);
    }

}

// ************************************************************************* //
